{"type":"data","nodes":[null,{"type":"data","data":[{"includesFwk":1,"menu":2},true,[3,16,33,53,81],{"title":4,"submenu":5},"Getting started",[6,10,13],{"label":7,"status":8,"path":9,"subpath":8},"Introduction","","docs/svelte/getting-started/introduction",{"label":11,"status":8,"path":12,"subpath":8},"Features","docs/svelte/getting-started/features",{"label":14,"status":8,"path":15,"subpath":8},"Installation","docs/svelte/getting-started/installation",{"title":17,"submenu":18},"Headless",[19,21,24,27,30],{"label":7,"status":8,"path":20,"subpath":8},"docs/svelte/headless/introduction",{"label":22,"status":8,"path":23,"subpath":8},"Configuration","docs/svelte/headless/configuration",{"label":25,"status":8,"path":26,"subpath":8},"Slots","docs/svelte/headless/slots",{"label":28,"status":8,"path":29,"subpath":8},"Directives","docs/svelte/headless/directives",{"label":31,"status":8,"path":32,"subpath":8},"Implementation","docs/svelte/headless/implementation",{"title":34,"submenu":35},"DaisyUI",[36,41,44,47,50],{"label":37,"status":38,"path":39,"subpath":40},"Alert","stable","docs/svelte/daisyUI/alert/","headless",{"label":42,"status":38,"path":43,"subpath":40},"Pagination","docs/svelte/daisyUI/pagination/",{"label":45,"status":38,"path":46,"subpath":40},"Progressbar","docs/svelte/daisyUI/progressbar/",{"label":48,"status":38,"path":49,"subpath":40},"Rating","docs/svelte/daisyUI/rating/",{"label":51,"status":38,"path":52,"subpath":40},"Slider","docs/svelte/daisyUI/slider/",{"title":54,"submenu":55},"Components",[56,60,62,65,68,70,72,76,78],{"label":57,"status":38,"path":58,"subpath":59},"Accordion","docs/svelte/components/accordion/","examples",{"label":37,"status":38,"path":61,"subpath":59},"docs/svelte/components/alert/",{"label":63,"status":38,"path":64,"subpath":59},"Modal","docs/svelte/components/modal/",{"label":42,"status":66,"path":67,"subpath":59},"beta","docs/svelte/components/pagination/",{"label":45,"status":38,"path":69,"subpath":59},"docs/svelte/components/progressbar/",{"label":48,"status":38,"path":71,"subpath":59},"docs/svelte/components/rating/",{"label":73,"status":74,"path":75,"subpath":59},"Select","inprogress","docs/svelte/components/select/",{"label":51,"status":38,"path":77,"subpath":59},"docs/svelte/components/slider/",{"label":79,"status":66,"path":80,"subpath":59},"Toast","docs/svelte/components/toast/",{"title":82,"submenu":83},"Services",[84,86,89,92,95],{"label":7,"status":8,"path":85,"subpath":8},"docs/svelte/services/introduction",{"label":87,"status":8,"path":88,"subpath":8},"Focustrack","docs/svelte/services/focustrack",{"label":90,"status":8,"path":91,"subpath":8},"Floating UI","docs/svelte/services/floating-ui",{"label":93,"status":8,"path":94,"subpath":8},"Resize Observer","docs/svelte/services/resize-observer",{"label":96,"status":8,"path":97,"subpath":8},"Transition","docs/svelte/services/transition"],"uses":{"params":["framework"]}},{"type":"data","data":[{"slug":1,"prev":-1,"next":2,"content":9,"since":8},"getting-started/introduction",{"slug":3,"content":4,"title":5,"subpath":6,"status":6,"attributes":7},"getting-started/features","# Features\n\n## Agnostic core\n\nA framework-agnostic core of widget factories that provide reactive models and APIs to drive the data. These concepts are deeply explained in the [Introduction](00-Introduction.md) and [Headless](../01-Headless/00-Introduction.md).\n\n## Headless widgets\n\nEach widget is delivered in headless mode in Angular, React and Svelte using the same factory, but you can also use sthese factories for other JS framework of your choice, with a bit work work to create adapters.\nYou can use widgets with any front-end CSS framework.\nThis approach frees you from the complexity of widget logic, enabling you to concentrate on making your design stand out.\n\n## Accessible\n\nWidgets are designed with a strong emphasis on accessibility. We adhere to the [Web Content Accessibility Guidelines](https://www.w3.org/WAI/standards-guidelines/wcag) and established design patterns, by providing keyboard navigation, aria attributes and focus handlers; features are available in headless components, and rigorously tested in the bootstrap version of each component.\n\n## Highly configurable\n\nWidgets offer a multitude of properties and access points that allow for customization of their behavior, appearance, and user experience. These attributes can be uniquely configured for each widget instance at any given time.\n\n## Consistency\n\nCore is fully tested to ensure consistent functionality across different framework implementations of the widgets. Additionally, we maintain uniformity in the markup used by each framework’s widget implementation\n\n## Bootstrap CSS widgets\n\nBootstrap CSS widgets are available for Angular, React and Svelte in separated packages.\n","Features","",{"since":8},"0.1.1","# Introduction\n\nAgnosUI is a versatile widget library designed for various frameworks, providing a consistent user interface across platforms. Its core (also referred to as headless), written in pure TypeScript, serves as a foundation that can be utilized by any framework to generate a user interface.\n\nYou can integrate AgnosUI in two primary ways:\n\n- Use the ready-made widgets provided for your specific framework.\n\nThis straightforward approach allows you to quickly incorporate widgets into your project. Refer to the component documentation for usage details. Currently, AgnosUI supports Angular, React, and Svelte.\n\n- use the headless functionality to create your own customized widget.\n\nThis approach offers complete customization of widgets, including markup and styling, while benefiting from AgnosUI's headless capabilities for managing display and interactions.\n\nThis method requires a deeper understanding and more effort, detailed in the comprehensive documentation. You can start building your widget based on existing widget code.\n\n## Motivation\n\nMaintaining full widget libraries over time can be challenging due to framework changes, shifts in usage patterns, and projects adopting different frameworks. AgnosUI addresses this challenge by separating the state and behavior of a widget from its rendering engine (the frameworks). This separation brings stability and several benefits:\n\n- Core functionalities are managed in pure TypeScript, avoiding issues tied to UI frameworks' constraints.\n- The main code stays the same even if the framework changes.\n- Fixes or new features seamlessly apply to all supported frameworks.\n- Unit tests are straightforward, focusing on the core written in pure Typescript for enduring reliability.\n- UI Frameworks are used only rendering the UI based on the widget state.\n- Consistency is maintained across frameworks, ensuring uniformity for organizations using different frameworks.\n\n## How does it work ?\n\nThe basic idea is to manage a widget from a data point of view only and APIs to interact with these data. This is a global picture:\n\nThe fundamental concept of AgnosUI revolves around managing a widget purely from a data perspective, along with APIs to interact with this data. The high-level workflow is illustrated below:\n\n![svg](../../demo/src/resources/images/overview-workflow.svg)\n\nAgnosUI constructs widgets based on data, independent of the rendering engine in use. To be framework-agnostic, the system must provide:\n\n- All necessary data for the UI.\n- APIs to modify this data.\n- A reactive system to notify the rendering engine of data changes, enabling synchronized UI updates.\n\n## Reactivity with Tansu\n\nThe reactivity in AgnosUI is managed with [Tansu](https://github.com/AmadeusITGroup/tansu).\n\nTansu has been initially developed by following the Svelte store specifications. It then extends its features to achieve full store management capabilities:\n\n- Supports all [Svelte stores specifications](https://svelte.dev/docs/svelte-store),\n- The `Signal` capabilities have been added. Notably, `computed` is available in addition to `derived`. The store itself is a function that can be invoked to obtain the current value.\n- A `batch` method is provided to mitigate glitch issues.\n- Synchronous subscriber calls are ensured to prevent unpredictable issues when integrating with other frameworks.\n\nTansu is the chosen solution due to its comprehensive feature set, making it the best fit for AgnosUI.\n\nIn this project, a Tansu object is typically referred to as a `store`, and corresponding variables are postfixes with a `$` sign.\n\n## Integration in frameworks\n\nCurrently, AgnosUI provides UI adapters for three frameworks: Angular, React, and Svelte.\n\nUsing them is straightforward, just like any other external library. Import a widget and use it in your project. Refer to the specific documentation for each framework to understand the implementation details.\n\nTo make the most of AgnosUI, familiarize yourself with the following concepts:\n\n- AgnosUI comes with a comprehensive configuration system. Each prop of every widget has a default value that can be overridden at any level of the component subtree. For more details, check out the [configuration section](../01-Headless/01-Configuration.md).\n\n- Slots provide a means to customize your widget through content projection. Learn more in [this section](../01-Headless/02-Slots.md).\n\n- Certain utilities are designed to be used as or with a directive. Directives are simple functions that can be applied to a DOM element. Learn more about this topic in [this section](../01-Headless/03-Directives.md).\n\n## Headless\n\nAs AgnosUI widgets are built on a reactive data system, you can leverage the core to create your own markup, using the data and the API to manage the UI and its behavior.\n\nLearn more about this in the [headless section](../01-Headless/00-Introduction.md)\n"],"uses":{"params":["slug","framework"]}}]}
